In [1]:
import pandas as pd

In [2]:
covid19_data = {'지역': ['서울','경기','인천','강원'],'확진자': [6272,5647,1062,296],'증감수치': [37,21,1,4]}
df = pd.DataFrame(covid19_data)
df

   지역   확진자  증감수치
0  서울  6272    37
1  경기  5647    21
2  인천  1062     1
3  강원   296     4

In [3]:
location = df['지역']
location

0    서울
1    경기
2    인천
3    강원
Name: 지역, dtype: object

In [4]:
seoul = df.loc[0]
seoul

지역        서울
확진자     6272
증감수치      37
Name: 0, dtype: object

In [19]:
#서울에서 발생한 서울, 확진자, 증감수치를 출력하시오.
seoul = df['지역']=='서울'
seoul_df = df[seoul]
seoul_df

   지역   확진자  증감수치
0  서울  6272    37

In [14]:
d1 = {'col1': [1,2],'col2': [3,4]}
d1

{'col1': [1, 2], 'col2': [3, 4]}

In [15]:
df1 = pd.DataFrame(data=d1)
df1

   col1  col2
0     1     3
1     2     4

In [18]:
df1_transposed = df1.T # or df1.transpose()
df1_transposed

      0  1
col1  1  2
col2  3  4